In [1]:
import numpy as np
import pandas as pd

In [20]:
data = pd.read_csv('C:/Users/Dua/Desktop/csv.csv')

In [21]:
data

     Name   Fname   Age
0  Nabeel   iqbal  20.0
1  Sameer  saleem  20.0
2  Salman   rahim  19.0
3     Ali   unaid  21.0
4   Fahad  Sheikh   NaN

In [22]:
age = data['Age']

In [23]:
age

0    20.0
1    20.0
2    19.0
3    21.0
4     NaN
Name: Age, dtype: float64

In [24]:
age.mean()

20.0

In [25]:
data['Name'] == 'Nabeel'

0     True
1    False
2    False
3    False
4    False
Name: Name, dtype: bool

In [26]:
data[data['Name'] == 'Nabeel']

     Name  Fname   Age
0  Nabeel  iqbal  20.0

In [27]:
data[(data['Name'] == 'Sameer') & (data['Fname'] == 'saleem')]

     Name   Fname   Age
1  Sameer  saleem  20.0

In [28]:
data[(data['Name'] == 'Sameer') |(data['Age'] == 19)]

     Name   Fname   Age
1  Sameer  saleem  20.0
2  Salman   rahim  19.0

# Today's Class
# Data Cleaning And Preparation

Anomily = Those values which does not match to attribute e.x: Age is given 1000

Missing Values = Values are missing

Non-Meaningful Headings = e.x: Age is given Lee Market

Duplicate Values = Two times repeated values can create problem

In [29]:
data.isnull()

    Name  Fname    Age
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False
4  False  False   True

In [30]:
data.dropna() # remove not available value in row

     Name   Fname   Age
0  Nabeel   iqbal  20.0
1  Sameer  saleem  20.0
2  Salman   rahim  19.0
3     Ali   unaid  21.0

In [31]:
data.notnull() # oppostie of null

   Name  Fname    Age
0  True   True   True
1  True   True   True
2  True   True   True
3  True   True   True
4  True   True  False

In [32]:
comp_data = data.dropna()
comp_data

     Name   Fname   Age
0  Nabeel   iqbal  20.0
1  Sameer  saleem  20.0
2  Salman   rahim  19.0
3     Ali   unaid  21.0

In [33]:
comp_data = data.dropna(axis = 1) # remove not availbale value column wise
comp_data

     Name   Fname
0  Nabeel   iqbal
1  Sameer  saleem
2  Salman   rahim
3     Ali   unaid
4   Fahad  Sheikh

In [34]:
data.dropna(how = 'all') # it will remove the row if all the cells value is equal to NaN

     Name   Fname   Age
0  Nabeel   iqbal  20.0
1  Sameer  saleem  20.0
2  Salman   rahim  19.0
3     Ali   unaid  21.0
4   Fahad  Sheikh   NaN

In [35]:
data.dropna(axis = 1, how = 'all') # it will remove the column if all the cells value is equal to NaN

     Name   Fname   Age
0  Nabeel   iqbal  20.0
1  Sameer  saleem  20.0
2  Salman   rahim  19.0
3     Ali   unaid  21.0
4   Fahad  Sheikh   NaN

In [36]:
data.iloc[0, 1]

'iqbal'

In [37]:
0data.fillna(0) # filling in missing data(NaN)

     Name   Fname   Age
0  Nabeel   iqbal  20.0
1  Sameer  saleem  20.0
2  Salman   rahim  19.0
3     Ali   unaid  21.0
4   Fahad  Sheikh   0.0

In [45]:
data.dropna(thresh = 2) # use to keep the values if the row contain atleast two values

     Name   Fname   Age
0  Nabeel   iqbal  20.0
1  Sameer  saleem  20.0
2  Salman   rahim  19.0
3     Ali   unaid  21.0
4   Fahad  Sheikh   NaN

In [46]:
data.fillna({'Age': '27'}) #By using dictionary we can fill the specific value of colum by providing column name and than its value

     Name   Fname Age
0  Nabeel   iqbal  20
1  Sameer  saleem  20
2  Salman   rahim  19
3     Ali   unaid  21
4   Fahad  Sheikh  27

In [56]:
df = pd.DataFrame(np.random.randn(6, 3))
df.iloc[2:, 1] = np.NaN
df.iloc[4:, 2] = np.NaN

In [57]:
df

          0         1         2
0 -0.143794  0.147473 -0.862299
1  0.579231  0.793768  0.092666
2  0.732143       NaN -0.411028
3 -0.205243       NaN -2.274627
4  0.469054       NaN       NaN
5 -0.343657       NaN       NaN

In [58]:
df.fillna(method = 'ffill')

          0         1         2
0 -0.143794  0.147473 -0.862299
1  0.579231  0.793768  0.092666
2  0.732143  0.793768 -0.411028
3 -0.205243  0.793768 -2.274627
4  0.469054  0.793768 -2.274627
5 -0.343657  0.793768 -2.274627

In [59]:
df.fillna(method = 'ffill', limit = 3)

          0         1         2
0 -0.143794  0.147473 -0.862299
1  0.579231  0.793768  0.092666
2  0.732143  0.793768 -0.411028
3 -0.205243  0.793768 -2.274627
4  0.469054  0.793768 -2.274627
5 -0.343657       NaN -2.274627

In [61]:
data = pd.Series([1., np.NaN, 3.5, np.NaN, 7])
data.fillna(data.mean())

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

In [62]:
# Data Transformation
# removing duplicates
data = pd.DataFrame({'k1': ['one', 'two'] * 3 + ['two'],
                    'k2': [1, 1, 2, 3, 3, 4, 4]})

In [63]:
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [65]:
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [67]:
unique_record = data.drop_duplicates()  # will remove the duplicated row
unique_record

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [68]:
data.drop_duplicates(['k1', 'k2'], keep='last')

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
6  two   4

In [69]:
data.drop_duplicates(['k1'])

    k1  k2
0  one   1
1  two   1

map aik function k uper implement hota hai. uss function mein array k uper ja kr aik aik element k uper mapping krta hai

# Replacing values

In [70]:
data = pd.Series([1., -999., 2., -999., -1000., 3.]) # smjho k -999 aesi value hai jis ka koi mtlb nh bnta
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [71]:
data.replace(-999, np.NaN)

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [72]:
data.replace([-999, -1000], np.NaN)

0    1.0
1    NaN
2    2.0
3    NaN
4    NaN
5    3.0
dtype: float64

In [73]:
data.replace({-999: np.NaN, -1000: 0})

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64